---
kind: method
id: M:Autodesk.Revit.DB.View.CanModifyDisplayStyle
zh: 视图
source: html/6fc7e0a1-9511-6aba-f989-66b0fa3de2d6.htm
---
# Autodesk.Revit.DB.View.CanModifyDisplayStyle Method

**中文**: 视图

Indicates if DisplayStyle can be modified.

## Syntax (C#)
```csharp
public bool CanModifyDisplayStyle()
```

## Returns
True if DisplayStyle can be modified.